Autodesk.Revit.DB.Surface.ProjectWithGuessPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV@,System.Double@)
Project a 3D point orthogonally onto a surface (to find the nearest point).
This method is meant to be used when a good approximate solution for the projection is available.
Throws InvalidOperationException if the projection fails.
point:
The point to project.
guessUV:
The calculation will look for a project near the provided UV.
uv:
The surface coordinates of the projected point.
distance:
Holds the distance from input point to its projection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The projection failed.
Since:
2018.1

Autodesk.Revit.DB.Surface.Project(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.UV@,System.Double@)
Project a 3D point orthogonally onto a surface (to find the nearest point).
Throws InvalidOperationException if the projection fails.
point:
The point to project.
uv:
The surface coordinates of the projected point.
distance:
Holds the distance from input point to its projection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The projection failed.
Since:
2018.1

Autodesk.Revit.DB.Surface.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Surface.OrientationMatchesParametricOrientation
Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
Remarks:
(Revit uses only orientable surfaces).
At any point on a surface, the surface's orientation is specified by a choice of the direction for the normal vector
at that point.The direction can either match or be opposite to the direction of the parametric normal vector,
which is the cross product of the surface's first partial derivatives: dS/du x dS/dv.
The parametric normal vectors define the parametric orientation.
A surface's orientation is then defined by getOrientationMatchesParametricOrientation() -
if getOrientationMatchesParametricOrientation() is true, the surface's orientation is the same as its
parametric orientation; otherwise it is opposite to its parametric orientation.
The purpose of this information to an API user:
Some systems, Industry Foundation Classes (IFC) for example, may only have parametric orientation for its surfaces.
In such a system, the surface normal will always be the parametric normal, whereas
in Revit, the surface normal will be the same as or opposite to the parametric normal according as
getOrientationMatchesParametricOrientation is true or false.
A user who is not familiar with Revit's orientation conventions might assume that Revit's normal vector is
the same as the parametric normal, which is not always correct.  Hence, this information is needed if and when
the user tries to export Revit Geometry to IFC, for example.
See also Face::OrientationMatchesSurfaceOrientation.
Since:
2018

Autodesk.Revit.DB.Surface
A mathematical representation of a surface.
Remarks:
This geometric object is not bounded by edges or edge loops.  A bounded surface obtained from a Revit element
will be represented by a Autodesk.Revit.DB.Face instead.
Since:
2016